; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_3 object type_1 type_2)
 (:predicates (pred_1 ?v5 - type_1 ?v2 - type_3)
 	      (pred_2 ?v7 - object ?v2 - type_3)
	      (pred_4 ?v5 - type_1 ?v6 - type_2)
	      (pred_3 ?v5 - type_1 ?v7 - object ?v6 - type_2))

   (:action op_3
       :parameters  (?v5 - type_1 ?v1 ?v3 - type_3)
       :precondition (and  (pred_1 ?v5 ?v1))
       :effect (and  (pred_1 ?v5 ?v3)
		     (not (pred_1 ?v5 ?v1))))

   (:action op_2
       :parameters (?v5 - type_1 ?v8 - object ?v4 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v4) (pred_1 ?v5 ?v4) (pred_4 ?v5 ?v6))
       :effect (and (pred_3 ?v5 ?v8 ?v6)
		    (not (pred_2 ?v8 ?v4)) 
		    (not (pred_4 ?v5 ?v6))))

   (:action op_1
       :parameters (?v5 - type_1 ?v8 - object ?v4 - type_3 ?v6 - type_2)
       :precondition  (and  (pred_3 ?v5 ?v8 ?v6) (pred_1 ?v5 ?v4))
       :effect (and (pred_2 ?v8 ?v4)
		    (pred_4 ?v5 ?v6)
		    (not (pred_3 ?v5 ?v8 ?v6)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_05 obj_03 - type_1
obj_08 obj_09 obj_10 obj_02 - type_2
obj_04 obj_07 obj_01 - type_3
obj_11 obj_06 obj_12 - object)
(:init
(pred_1 obj_05 obj_01)
(pred_4 obj_05 obj_08)
(pred_4 obj_05 obj_09)
(pred_1 obj_03 obj_07)
(pred_4 obj_03 obj_10)
(pred_4 obj_03 obj_02)
(pred_2 obj_11 obj_07)
(pred_2 obj_06 obj_01)
(pred_2 obj_12 obj_07)
)
(:goal
(and
(pred_2 obj_11 obj_01)
(pred_2 obj_06 obj_07)
(pred_2 obj_12 obj_04)
)
)

(:constraints
  (and
    (always (not (and (pred_1 obj_05 obj_01) (pred_1 obj_03 obj_01))))
  )
)
)

; plan
1. (op_2 obj_03 obj_12 obj_07 obj_02)
   deleted: (pred_2 obj_12 obj_07) (pred_4 obj_03 obj_02)
   added: (pred_3 obj_03 obj_12 obj_02)
   goals met: 0 of 3
2. (op_2 obj_03 obj_11 obj_07 obj_10)
   deleted: (pred_2 obj_11 obj_07) (pred_4 obj_03 obj_10)
   added: (pred_3 obj_03 obj_11 obj_10)
   goals met: 0 of 3
3. (op_2 obj_05 obj_06 obj_01 obj_09)
   deleted: (pred_2 obj_06 obj_01) (pred_4 obj_05 obj_09)
   added: (pred_3 obj_05 obj_06 obj_09)
   goals met: 0 of 3
4. (op_3 obj_05 obj_01 obj_07)
   deleted: (pred_1 obj_05 obj_01)
   added: (pred_1 obj_05 obj_07)
   goals met: 0 of 3
5. (op_3 obj_03 obj_07 obj_01)
   deleted: (pred_1 obj_03 obj_07)
   added: (pred_1 obj_03 obj_01)
   goals met: 0 of 3
6. (op_1 obj_03 obj_11 obj_01 obj_10)
   deleted: (pred_3 obj_03 obj_11 obj_10)
   added: (pred_2 obj_11 obj_01) (pred_4 obj_03 obj_10)
   goals met: 1 of 3
7. (op_1 obj_05 obj_06 obj_07 obj_09)
   deleted: (pred_3 obj_05 obj_06 obj_09)
   added: (pred_2 obj_06 obj_07) (pred_4 obj_05 obj_09)
   goals met: 2 of 3
8. (op_3 obj_03 obj_01 obj_04)
   deleted: (pred_1 obj_03 obj_01)
   added: (pred_1 obj_03 obj_04)
   goals met: 2 of 3
9. (op_1 obj_03 obj_12 obj_04 obj_02)
   deleted: (pred_3 obj_03 obj_12 obj_02)
   added: (pred_2 obj_12 obj_04) (pred_4 obj_03 obj_02)
   goals met: 3 of 3
